docs/k6-ranking-results/case4_혼합부하_bulk_clean_run2_20260410.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/ranking-throughput.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m50s max duration (incl. graceful stop):
              * case4_mixed: Up to 1000 looping VUs for 1m20s over 6 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-04-10T00:03:28+09:00" level=info msg="Waiting 15s for scheduler to populate ranking:all..." source=console

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

Run           [ 100% ] setup()
case4_mixed   [   0% ]

running (0m16.0s), 0003/1000 VUs, 6 complete and 0 interrupted iterations
case4_mixed   [   0% ] 0003/1000 VUs  0m00.4s/1m20.0s

running (0m17.0s), 0013/1000 VUs, 98 complete and 0 interrupted iterations
case4_mixed   [   2% ] 0013/1000 VUs  0m01.4s/1m20.0s

running (0m18.0s), 0023/1000 VUs, 228 complete and 0 interrupted iterations
case4_mixed   [   3% ] 0023/1000 VUs  0m02.4s/1m20.0s

running (0m19.0s), 0033/1000 VUs, 414 complete and 0 interrupted iterations
case4_mixed   [   4% ] 0033/1000 VUs  0m03.4s/1m20.0s

running (0m20.0s), 0043/1000 VUs, 589 complete and 0 interrupted iterations
case4_mixed   [   5% ] 0043/1000 VUs  0m04.4s/1m20.0s

running (0m21.0s), 0053/1000 VUs, 791 complete and 0 interrupted iterations
case4_mixed   [   7% ] 0053/1000 VUs  0m05.4s/1m20.0s

running (0m22.0s), 0063/1000 VUs, 913 complete and 0 interrupted iterations
case4_mixed   [   8% ] 0063/1000 VUs  0m06.4s/1m20.0s

running (0m23.0s), 0073/1000 VUs, 1104 complete and 0 interrupted iterations
case4_mixed   [   9% ] 0073/1000 VUs  0m07.4s/1m20.0s

running (0m24.0s), 0083/1000 VUs, 1372 complete and 0 interrupted iterations
case4_mixed   [  10% ] 0083/1000 VUs  0m08.4s/1m20.0s

running (0m25.0s), 0093/1000 VUs, 1588 complete and 0 interrupted iterations
case4_mixed   [  12% ] 0093/1000 VUs  0m09.4s/1m20.0s

running (0m26.0s), 0105/1000 VUs, 1784 complete and 0 interrupted iterations
case4_mixed   [  13% ] 0105/1000 VUs  0m10.4s/1m20.0s

running (0m27.0s), 0118/1000 VUs, 1994 complete and 0 interrupted iterations
case4_mixed   [  14% ] 0118/1000 VUs  0m11.4s/1m20.0s

running (0m28.0s), 0131/1000 VUs, 2231 complete and 0 interrupted iterations
case4_mixed   [  15% ] 0131/1000 VUs  0m12.4s/1m20.0s

running (0m29.0s), 0145/1000 VUs, 2409 complete and 0 interrupted iterations
case4_mixed   [  17% ] 0145/1000 VUs  0m13.4s/1m20.0s

running (0m30.0s), 0158/1000 VUs, 2644 complete and 0 interrupted iterations
case4_mixed   [  18% ] 0158/1000 VUs  0m14.4s/1m20.0s

running (0m31.0s), 0171/1000 VUs, 2862 complete and 0 interrupted iterations
case4_mixed   [  19% ] 0171/1000 VUs  0m15.4s/1m20.0s

running (0m32.0s), 0185/1000 VUs, 3050 complete and 0 interrupted iterations
case4_mixed   [  20% ] 0185/1000 VUs  0m16.4s/1m20.0s

running (0m33.0s), 0198/1000 VUs, 3280 complete and 0 interrupted iterations
case4_mixed   [  22% ] 0198/1000 VUs  0m17.4s/1m20.0s

running (0m34.0s), 0211/1000 VUs, 3417 complete and 0 interrupted iterations
case4_mixed   [  23% ] 0211/1000 VUs  0m18.4s/1m20.0s

running (0m35.0s), 0225/1000 VUs, 3597 complete and 0 interrupted iterations
case4_mixed   [  24% ] 0225/1000 VUs  0m19.4s/1m20.0s

running (0m36.0s), 0238/1000 VUs, 3838 complete and 0 interrupted iterations
case4_mixed   [  25% ] 0238/1000 VUs  0m20.4s/1m20.0s

running (0m37.0s), 0251/1000 VUs, 4068 complete and 0 interrupted iterations
case4_mixed   [  27% ] 0251/1000 VUs  0m21.4s/1m20.0s

running (0m38.0s), 0265/1000 VUs, 4343 complete and 0 interrupted iterations
case4_mixed   [  28% ] 0265/1000 VUs  0m22.4s/1m20.0s

running (0m39.0s), 0278/1000 VUs, 4548 complete and 0 interrupted iterations
case4_mixed   [  29% ] 0278/1000 VUs  0m23.4s/1m20.0s

running (0m40.0s), 0291/1000 VUs, 4773 complete and 0 interrupted iterations
case4_mixed   [  31% ] 0291/1000 VUs  0m24.4s/1m20.0s

running (0m41.0s), 0305/1000 VUs, 4967 complete and 0 interrupted iterations
case4_mixed   [  32% ] 0305/1000 VUs  0m25.4s/1m20.0s

running (0m42.0s), 0318/1000 VUs, 5146 complete and 0 interrupted iterations
case4_mixed   [  33% ] 0318/1000 VUs  0m26.4s/1m20.0s

running (0m43.0s), 0331/1000 VUs, 5347 complete and 0 interrupted iterations
case4_mixed   [  34% ] 0331/1000 VUs  0m27.4s/1m20.0s

running (0m44.0s), 0345/1000 VUs, 5562 complete and 0 interrupted iterations
case4_mixed   [  35% ] 0345/1000 VUs  0m28.4s/1m20.0s

running (0m45.0s), 0358/1000 VUs, 5766 complete and 0 interrupted iterations
case4_mixed   [  37% ] 0358/1000 VUs  0m29.4s/1m20.0s

running (0m46.0s), 0371/1000 VUs, 5910 complete and 0 interrupted iterations
case4_mixed   [  38% ] 0371/1000 VUs  0m30.4s/1m20.0s

running (0m47.0s), 0385/1000 VUs, 6031 complete and 0 interrupted iterations
case4_mixed   [  39% ] 0385/1000 VUs  0m31.4s/1m20.0s

running (0m48.0s), 0398/1000 VUs, 6339 complete and 0 interrupted iterations
case4_mixed   [  40% ] 0398/1000 VUs  0m32.4s/1m20.0s

running (0m49.0s), 0411/1000 VUs, 6474 complete and 0 interrupted iterations
case4_mixed   [  42% ] 0411/1000 VUs  0m33.4s/1m20.0s

running (0m50.0s), 0425/1000 VUs, 6762 complete and 0 interrupted iterations
case4_mixed   [  43% ] 0425/1000 VUs  0m34.4s/1m20.0s

running (0m51.0s), 0438/1000 VUs, 6925 complete and 0 interrupted iterations
case4_mixed   [  44% ] 0438/1000 VUs  0m35.4s/1m20.0s

running (0m52.0s), 0451/1000 VUs, 7175 complete and 0 interrupted iterations
case4_mixed   [  45% ] 0451/1000 VUs  0m36.4s/1m20.0s

running (0m53.0s), 0465/1000 VUs, 7409 complete and 0 interrupted iterations
case4_mixed   [  47% ] 0465/1000 VUs  0m37.4s/1m20.0s

running (0m54.0s), 0478/1000 VUs, 7612 complete and 0 interrupted iterations
case4_mixed   [  48% ] 0478/1000 VUs  0m38.4s/1m20.0s

running (0m55.0s), 0491/1000 VUs, 7795 complete and 0 interrupted iterations
case4_mixed   [  49% ] 0491/1000 VUs  0m39.4s/1m20.0s

running (0m56.0s), 0507/1000 VUs, 7990 complete and 0 interrupted iterations
case4_mixed   [  50% ] 0507/1000 VUs  0m40.4s/1m20.0s

running (0m57.0s), 0527/1000 VUs, 8234 complete and 0 interrupted iterations
case4_mixed   [  52% ] 0527/1000 VUs  0m41.4s/1m20.0s

running (0m58.0s), 0547/1000 VUs, 8380 complete and 0 interrupted iterations
case4_mixed   [  53% ] 0547/1000 VUs  0m42.4s/1m20.0s

running (0m59.0s), 0567/1000 VUs, 8595 complete and 0 interrupted iterations
case4_mixed   [  54% ] 0567/1000 VUs  0m43.4s/1m20.0s

running (1m00.0s), 0587/1000 VUs, 8807 complete and 0 interrupted iterations
case4_mixed   [  55% ] 0587/1000 VUs  0m44.4s/1m20.0s

running (1m01.0s), 0607/1000 VUs, 9070 complete and 0 interrupted iterations
case4_mixed   [  57% ] 0607/1000 VUs  0m45.4s/1m20.0s

running (1m02.0s), 0627/1000 VUs, 9249 complete and 0 interrupted iterations
case4_mixed   [  58% ] 0627/1000 VUs  0m46.4s/1m20.0s

running (1m03.0s), 0647/1000 VUs, 9472 complete and 0 interrupted iterations
case4_mixed   [  59% ] 0647/1000 VUs  0m47.4s/1m20.0s

running (1m04.0s), 0667/1000 VUs, 9639 complete and 0 interrupted iterations
case4_mixed   [  60% ] 0667/1000 VUs  0m48.4s/1m20.0s

running (1m05.0s), 0687/1000 VUs, 9902 complete and 0 interrupted iterations
case4_mixed   [  62% ] 0687/1000 VUs  0m49.4s/1m20.0s

running (1m06.0s), 0707/1000 VUs, 10019 complete and 0 interrupted iterations
case4_mixed   [  63% ] 0707/1000 VUs  0m50.4s/1m20.0s

running (1m07.0s), 0728/1000 VUs, 10306 complete and 0 interrupted iterations
case4_mixed   [  64% ] 0728/1000 VUs  0m51.4s/1m20.0s

running (1m08.0s), 0747/1000 VUs, 10423 complete and 0 interrupted iterations
case4_mixed   [  65% ] 0747/1000 VUs  0m52.4s/1m20.0s

running (1m09.0s), 0767/1000 VUs, 10638 complete and 0 interrupted iterations
case4_mixed   [  67% ] 0767/1000 VUs  0m53.4s/1m20.0s

running (1m10.0s), 0787/1000 VUs, 10803 complete and 0 interrupted iterations
case4_mixed   [  68% ] 0787/1000 VUs  0m54.4s/1m20.0s

running (1m11.0s), 0805/1000 VUs, 10986 complete and 0 interrupted iterations
case4_mixed   [  69% ] 0805/1000 VUs  0m55.4s/1m20.0s

running (1m12.0s), 0818/1000 VUs, 11226 complete and 0 interrupted iterations
case4_mixed   [  70% ] 0818/1000 VUs  0m56.4s/1m20.0s

running (1m13.0s), 0831/1000 VUs, 11434 complete and 0 interrupted iterations
case4_mixed   [  72% ] 0831/1000 VUs  0m57.4s/1m20.0s

running (1m14.0s), 0845/1000 VUs, 11605 complete and 0 interrupted iterations
case4_mixed   [  73% ] 0845/1000 VUs  0m58.4s/1m20.0s

running (1m15.0s), 0858/1000 VUs, 11743 complete and 0 interrupted iterations
case4_mixed   [  74% ] 0858/1000 VUs  0m59.4s/1m20.0s

running (1m16.0s), 0871/1000 VUs, 11988 complete and 0 interrupted iterations
case4_mixed   [  75% ] 0871/1000 VUs  1m00.4s/1m20.0s

running (1m17.0s), 0885/1000 VUs, 12151 complete and 0 interrupted iterations
case4_mixed   [  77% ] 0885/1000 VUs  1m01.4s/1m20.0s

running (1m18.0s), 0898/1000 VUs, 12395 complete and 0 interrupted iterations
case4_mixed   [  78% ] 0898/1000 VUs  1m02.4s/1m20.0s

running (1m19.0s), 0911/1000 VUs, 12530 complete and 0 interrupted iterations
case4_mixed   [  79% ] 0911/1000 VUs  1m03.4s/1m20.0s

running (1m20.0s), 0925/1000 VUs, 12778 complete and 0 interrupted iterations
case4_mixed   [  80% ] 0925/1000 VUs  1m04.4s/1m20.0s

running (1m21.0s), 0938/1000 VUs, 12874 complete and 0 interrupted iterations
case4_mixed   [  82% ] 0938/1000 VUs  1m05.4s/1m20.0s

running (1m22.0s), 0951/1000 VUs, 13068 complete and 0 interrupted iterations
case4_mixed   [  83% ] 0951/1000 VUs  1m06.4s/1m20.0s

running (1m23.0s), 0965/1000 VUs, 13246 complete and 0 interrupted iterations
case4_mixed   [  84% ] 0965/1000 VUs  1m07.4s/1m20.0s

running (1m24.0s), 0978/1000 VUs, 13483 complete and 0 interrupted iterations
case4_mixed   [  85% ] 0978/1000 VUs  1m08.4s/1m20.0s

running (1m25.0s), 0991/1000 VUs, 13669 complete and 0 interrupted iterations
case4_mixed   [  87% ] 0991/1000 VUs  1m09.4s/1m20.0s

running (1m26.0s), 1000/1000 VUs, 13936 complete and 0 interrupted iterations
case4_mixed   [  88% ] 1000/1000 VUs  1m10.4s/1m20.0s

running (1m27.0s), 0987/1000 VUs, 14135 complete and 0 interrupted iterations
case4_mixed   [  89% ] 0987/1000 VUs  1m11.4s/1m20.0s

running (1m28.0s), 0941/1000 VUs, 14384 complete and 0 interrupted iterations
case4_mixed   [  90% ] 0941/1000 VUs  1m12.4s/1m20.0s

running (1m29.0s), 0880/1000 VUs, 14602 complete and 0 interrupted iterations
case4_mixed   [  92% ] 0880/1000 VUs  1m13.4s/1m20.0s

running (1m30.0s), 0790/1000 VUs, 14820 complete and 0 interrupted iterations
case4_mixed   [  93% ] 0790/1000 VUs  1m14.4s/1m20.0s

running (1m31.0s), 0677/1000 VUs, 15070 complete and 0 interrupted iterations
case4_mixed   [  94% ] 0677/1000 VUs  1m15.4s/1m20.0s

running (1m32.0s), 0595/1000 VUs, 15232 complete and 0 interrupted iterations
case4_mixed   [  95% ] 0595/1000 VUs  1m16.4s/1m20.0s

running (1m33.0s), 0480/1000 VUs, 15433 complete and 0 interrupted iterations
case4_mixed   [  97% ] 0480/1000 VUs  1m17.4s/1m20.0s

running (1m34.0s), 0335/1000 VUs, 15672 complete and 0 interrupted iterations
case4_mixed   [  98% ] 0335/1000 VUs  1m18.4s/1m20.0s

running (1m35.0s), 0200/1000 VUs, 15900 complete and 0 interrupted iterations
case4_mixed   [  99% ] 0200/1000 VUs  1m19.4s/1m20.0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.05' rate=1.23%


  █ TOTAL RESULTS 

    checks_total.......: 16114  168.109109/s
    checks_succeeded...: 99.98% 16112 out of 16114
    checks_failed......: 0.01%  2 out of 16114

    ✓ 랭킹 200
    ✓ 추가조회 200
    ✓ 조회 200
    ✗ 좋아요 200
      ↳  99% — ✓ 2390 / ✗ 2

    CUSTOM
    product_detail_duration_ms.....: avg=3.28s min=60.63ms med=3.24s max=7.41s p(90)=5.57s p(95)=5.9s 
    ranking_read_duration_ms.......: avg=1.54s min=803µs   med=1.3s  max=4.47s p(90)=3.55s p(95)=3.76s
    total_reads....................: 8111   84.617909/s
    total_writes...................: 8003   83.4912/s
    write_errors...................: 2      0.020865/s

    HTTP
    http_req_duration..............: avg=2.36s min=650µs   med=2.25s max=7.41s p(90)=5.05s p(95)=5.54s
      { expected_response:true }...: avg=2.39s min=803µs   med=2.29s max=7.41s p(90)=5.06s p(95)=5.55s
    http_req_failed................: 1.23%  202 out of 16385
    http_reqs......................: 16385  170.936314/s

    EXECUTION
    iteration_duration.............: avg=2.45s min=50.93ms med=2.36s max=7.47s p(90)=5.12s p(95)=5.6s 
    iterations.....................: 16114  168.109109/s
    vus............................: 200    min=0            max=1000
    vus_max........................: 1000   min=1000         max=1000

    NETWORK
    data_received..................: 4.5 MB 47 kB/s
    data_sent......................: 2.4 MB 25 kB/s



running (1m35.9s), 0000/1000 VUs, 16114 complete and 0 interrupted iterations
case4_mixed ✓ [ 100% ] 0000/1000 VUs  1m20s